; ModuleID = '/home/secondst/linux/linux-ce624b2089ea/drivers/net/can/slcan.c'
source_filename = "/home/secondst/linux/linux-ce624b2089ea/drivers/net/can/slcan.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.module = type { i32, %struct.list_head, [56 x i8], %struct.module_kobject, ptr, ptr, ptr, ptr, ptr, ptr, i32, %struct.mutex, ptr, i32, i32, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i8, i8, ptr, ptr, i32, i32, ptr, ptr, [56 x i8], ptr, ptr, i32, i32, i32, i32, %struct.mod_tree_node, %struct.mod_tree_node, i32, i32, %struct.mod_arch_specific, i32, i32, %struct.list_head, ptr, ptr, %struct.mod_kallsyms, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i32, i32, ptr, ptr, i32, ptr, i32, i32, ptr, i8, %struct.list_head, %struct.list_head, ptr, %struct.atomic_t }
%struct.module_kobject = type { %struct.kobject, ptr, ptr, ptr, ptr }
%struct.kobject = type { ptr, %struct.list_head, ptr, ptr, ptr, ptr, %struct.kref, i8 }
%struct.kref = type { %struct.atomic_t }
%struct.mutex = type { %struct.atomic_t, %struct.spinlock, %struct.list_head, ptr, %struct.optimistic_spin_queue }
%struct.spinlock = type { %union.anon.8 }
%union.anon.8 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock }
%struct.arch_spinlock = type { %union.anon.9 }
%union.anon.9 = type { i32 }
%struct.optimistic_spin_queue = type { %struct.atomic_t }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_alias0", scope: !2, file: !9225, line: 59, type: !9328, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "Ubuntu clang version 15.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !9211, globals: !9250, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/secondst/linux/linux-ce624b2089ea/drivers/net/can/slcan.c", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "324c89076242b19f7995f34db9d1d78e")
!4 = !{!5, !13, !19, !24, !29, !37, !45, !7615, !3340, !3469, !3477, !3600, !3655, !7956, !8117, !8143, !8160, !8400, !8742, !8752, !5136, !5815, !6052, !6404, !6656, !6768, !9098, !9119, !9150, !9199, !9204}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 291, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/linux/module.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "c517ed94743e9880403fc3b6cfc4f4cf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!10 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!11 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!12 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !14, line: 27, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "3af0ea42167001b2347897844b466b5d")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!18 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writeback_sync_modes", file: !20, line: 36, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "include/linux/writeback.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "21a33ae1dd1ed9516b974c8c2b3a63a9")
!21 = !{!22, !23}
!22 = !DIEnumerator(name: "WB_SYNC_NONE", value: 0)
!23 = !DIEnumerator(name: "WB_SYNC_ALL", value: 1)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !25, line: 44, baseType: !7, size: 32, elements: !26)
!25 = !DIFile(filename: "include/linux/hrtimer.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "d7fa7e92cc9bafd9750853eefc7bd08e")
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!28 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !30, line: 6, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "include/linux/pid.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "7f900370efc551e7057c389157da92df")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!33 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!34 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!35 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!36 = !DIEnumerator(name: "__PIDTYPE_TGID", value: 4)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netdev_tx", file: !38, line: 104, baseType: !39, size: 32, elements: !40)
!38 = !DIFile(filename: "include/linux/netdevice.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "c92a323e75f2c4af495b4dceccd819a4")
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "__NETDEV_TX_MIN", value: -2147483648)
!42 = !DIEnumerator(name: "NETDEV_TX_OK", value: 0)
!43 = !DIEnumerator(name: "NETDEV_TX_BUSY", value: 16)
!44 = !DIEnumerator(name: "NETDEV_TX_LOCKED", value: 32)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !47, file: !46, line: 172, baseType: !7, size: 32, elements: !9094)
!46 = !DIFile(filename: "include/linux/skbuff.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "ad29fedb0c509e557220681158a1f11f")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nf_bridge_info", file: !46, line: 170, size: 320, elements: !48)
!48 = !{!49, !55, !56, !60, !61, !62, !66, !9086, !9087}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !47, file: !46, line: 171, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !51, line: 177, baseType: !52)
!51 = !DIFile(filename: "include/linux/types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "48fcca61c227d321557be02c8bee449d")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 175, size: 32, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !52, file: !51, line: 176, baseType: !39, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "orig_proto", scope: !47, file: !46, line: 176, baseType: !45, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_otherhost", scope: !47, file: !46, line: 177, baseType: !57, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !58, line: 16, baseType: !59)
!58 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "be4685aeb7e05c85c4dbc18556740954")
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "in_prerouting", scope: !47, file: !46, line: 178, baseType: !57, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bridged_dnat", scope: !47, file: !46, line: 179, baseType: !57, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "frag_max_size", scope: !47, file: !46, line: 180, baseType: !63, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !64, line: 23, baseType: !65)
!64 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "e7b01717b77d78306f634f1bc786e948")
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "physindev", scope: !47, file: !46, line: 181, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !38, line: 1538, size: 16384, elements: !69)
!69 = !{!70, !75, !82, !84, !86, !87, !88, !89, !90, !91, !97, !98, !99, !100, !101, !102, !107, !112, !117, !118, !119, !120, !121, !122, !123, !124, !150, !158, !159, !163, !166, !7424, !7842, !7846, !7850, !7876, !7877, !7878, !7879, !7880, !7881, !7882, !7883, !7884, !7885, !7886, !7887, !7888, !7889, !7890, !7891, !7892, !7893, !7894, !7895, !7896, !7897, !7898, !7899, !7904, !7905, !7906, !7907, !7908, !7909, !7912, !8339, !8342, !8343, !8346, !8349, !8352, !8353, !8356, !8359, !8362, !8363, !8364, !8391, !8392, !8393, !8394, !8407, !8408, !8707, !8708, !8709, !8710, !8713, !8714, !8715, !8716, !8717, !8718, !8719, !8720, !8721, !8735, !8736, !8737, !8738, !8739, !8740, !8741, !8750, !8751, !8756, !8757, !8758, !8759, !8781, !8784, !8787, !8788, !8790, !8791, !8860, !8861, !8862, !8863, !9064, !9065, !9071, !9072, !9073, !9082, !9083, !9085}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !38, line: 1539, baseType: !71, size: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !73)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !{!74}
!74 = !DISubrange(count: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name_hlist", scope: !68, file: !38, line: 1540, baseType: !76, size: 128, offset: 128)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !51, line: 193, size: 128, elements: !77)
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !51, line: 194, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !76, file: !51, line: 194, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !68, file: !38, line: 1541, baseType: !83, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !68, file: !38, line: 1546, baseType: !85, size: 64, offset: 320)
!85 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !68, file: !38, line: 1547, baseType: !85, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !68, file: !38, line: 1548, baseType: !85, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !68, file: !38, line: 1549, baseType: !39, size: 32, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_changes", scope: !68, file: !38, line: 1551, baseType: !50, size: 32, offset: 544)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !68, file: !38, line: 1559, baseType: !85, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !68, file: !38, line: 1561, baseType: !92, size: 128, offset: 640)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !51, line: 185, size: 128, elements: !93)
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !51, line: 186, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !92, file: !51, line: 186, baseType: !95, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !68, file: !38, line: 1562, baseType: !92, size: 128, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !68, file: !38, line: 1563, baseType: !92, size: 128, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !68, file: !38, line: 1564, baseType: !92, size: 128, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !68, file: !38, line: 1565, baseType: !92, size: 128, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !68, file: !38, line: 1566, baseType: !92, size: 128, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !68, file: !38, line: 1571, baseType: !103, size: 256, offset: 1408)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !38, line: 1568, size: 256, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !103, file: !38, line: 1569, baseType: !92, size: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !103, file: !38, line: 1570, baseType: !92, size: 128, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "all_adj_list", scope: !68, file: !38, line: 1576, baseType: !108, size: 256, offset: 1664)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !38, line: 1573, size: 256, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !108, file: !38, line: 1574, baseType: !92, size: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !108, file: !38, line: 1575, baseType: !92, size: 128, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !68, file: !38, line: 1578, baseType: !113, size: 64, offset: 1920)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !114, line: 17, baseType: !115)
!114 = !DIFile(filename: "include/linux/netdev_features.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "d51896afd0ebce6795bde7a215fad17c")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !58, line: 25, baseType: !116)
!116 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !68, file: !38, line: 1579, baseType: !113, size: 64, offset: 1984)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !68, file: !38, line: 1580, baseType: !113, size: 64, offset: 2048)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !68, file: !38, line: 1581, baseType: !113, size: 64, offset: 2112)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !68, file: !38, line: 1582, baseType: !113, size: 64, offset: 2176)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !68, file: !38, line: 1583, baseType: !113, size: 64, offset: 2240)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !68, file: !38, line: 1585, baseType: !39, size: 32, offset: 2304)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !68, file: !38, line: 1586, baseType: !39, size: 32, offset: 2336)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !68, file: !38, line: 1588, baseType: !125, size: 1472, offset: 2368)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !38, line: 157, size: 1472, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !125, file: !38, line: 158, baseType: !85, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !125, file: !38, line: 159, baseType: !85, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !125, file: !38, line: 160, baseType: !85, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !125, file: !38, line: 161, baseType: !85, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !125, file: !38, line: 162, baseType: !85, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !125, file: !38, line: 163, baseType: !85, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !125, file: !38, line: 164, baseType: !85, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !125, file: !38, line: 165, baseType: !85, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !125, file: !38, line: 166, baseType: !85, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !125, file: !38, line: 167, baseType: !85, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !125, file: !38, line: 168, baseType: !85, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !125, file: !38, line: 169, baseType: !85, size: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !125, file: !38, line: 170, baseType: !85, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !125, file: !38, line: 171, baseType: !85, size: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !125, file: !38, line: 172, baseType: !85, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !125, file: !38, line: 173, baseType: !85, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !125, file: !38, line: 174, baseType: !85, size: 64, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !125, file: !38, line: 175, baseType: !85, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !125, file: !38, line: 176, baseType: !85, size: 64, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !125, file: !38, line: 177, baseType: !85, size: 64, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !125, file: !38, line: 178, baseType: !85, size: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !125, file: !38, line: 179, baseType: !85, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !125, file: !38, line: 180, baseType: !85, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !68, file: !38, line: 1590, baseType: !151, size: 64, offset: 3840)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !152, line: 23, baseType: !153)
!152 = !DIFile(filename: "include/asm-generic/atomic-long.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "95b28c2a90d83463bd84a301ed62e8c1")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !51, line: 182, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 180, size: 64, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !154, file: !51, line: 181, baseType: !157, size: 64)
!157 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !68, file: !38, line: 1591, baseType: !151, size: 64, offset: 3904)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !68, file: !38, line: 1594, baseType: !160, size: 64, offset: 3968)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !38, line: 1594, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !68, file: !38, line: 1595, baseType: !164, size: 64, offset: 4032)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !38, line: 1595, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !68, file: !38, line: 1597, baseType: !167, size: 64, offset: 4096)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !38, line: 1064, size: 4416, elements: !170)
!170 = !{!171, !175, !179, !180, !181, !6978, !6986, !6990, !6991, !6995, !6996, !7096, !7101, !7105, !7109, !7110, !7141, !7146, !7150, !7151, !7152, !7158, !7159, !7183, !7188, !7192, !7196, !7200, !7201, !7220, !7224, !7237, !7248, !7252, !7253, !7257, !7258, !7259, !7263, !7267, !7268, !7284, !7288, !7292, !7296, !7297, !7301, !7305, !7306, !7307, !7322, !7326, !7362, !7367, !7371, !7372, !7376, !7385, !7389, !7393, !7394, !7398, !7402, !7406, !7407, !7411, !7415, !7419, !7420}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !169, file: !38, line: 1065, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!39, !67}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !169, file: !38, line: 1066, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !67}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !169, file: !38, line: 1067, baseType: !172, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !169, file: !38, line: 1068, baseType: !172, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !169, file: !38, line: 1069, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !186, !67}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !38, line: 110, baseType: !37)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !46, line: 547, size: 1856, elements: !188)
!188 = !{!189, !229, !6872, !6873, !6877, !6878, !6879, !6882, !6887, !6889, !6890, !6891, !6892, !6893, !6894, !6895, !6896, !6897, !6898, !6899, !6900, !6901, !6903, !6905, !6906, !6907, !6908, !6909, !6910, !6911, !6912, !6913, !6914, !6915, !6916, !6917, !6918, !6919, !6920, !6921, !6922, !6923, !6924, !6925, !6926, !6927, !6928, !6938, !6939, !6940, !6941, !6942, !6943, !6948, !6953, !6958, !6963, !6964, !6965, !6966, !6967, !6968, !6969, !6970, !6971, !6973, !6974, !6975, !6976, !6977}
!189 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !46, line: 548, baseType: !190, size: 192)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !46, line: 548, size: 192, elements: !191)
!191 = !{!192, !221}
!192 = !DIDerivedType(tag: DW_TAG_member, scope: !190, file: !46, line: 549, baseType: !193, size: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !46, line: 549, size: 192, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !46, line: 551, baseType: !186, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !193, file: !46, line: 552, baseType: !186, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !46, line: 554, baseType: !198, size: 64, offset: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !46, line: 554, size: 64, elements: !199)
!199 = !{!200, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !198, file: !46, line: 555, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !202, line: 41, baseType: !203)
!202 = !DIFile(filename: "include/linux/ktime.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "690133e16e983bf288802a96957fe14f")
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ktime", file: !202, line: 37, size: 64, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tv64", scope: !203, file: !202, line: 38, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !58, line: 24, baseType: !207)
!207 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp", scope: !198, file: !46, line: 556, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_mstamp", file: !46, line: 422, size: 64, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, scope: !209, file: !46, line: 423, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !46, line: 423, size: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v64", scope: !212, file: !46, line: 424, baseType: !115, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !212, file: !46, line: 425, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !46, line: 425, size: 64, elements: !217)
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_us", scope: !216, file: !46, line: 426, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !58, line: 22, baseType: !7)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_jiffies", scope: !216, file: !46, line: 427, baseType: !219, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !190, file: !46, line: 559, baseType: !222, size: 192, align: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !223, line: 36, size: 192, align: 64, elements: !224)
!223 = !DIFile(filename: "include/linux/rbtree.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "8201e150a2934aed9d162c8c6e74dbd5")
!224 = !{!225, !226, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !222, file: !223, line: 37, baseType: !85, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !222, file: !223, line: 38, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !222, file: !223, line: 39, baseType: !227, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !46, line: 562, baseType: !230, size: 64, offset: 192)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !46, line: 562, size: 64, elements: !231)
!231 = !{!232, !6871}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !230, file: !46, line: 563, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !235, line: 322, size: 5376, elements: !236)
!235 = !DIFile(filename: "include/net/sock.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "a0df72b2954214c40edd02aafdeb4b5c")
!236 = !{!237, !6617, !6624, !6625, !6632, !6633, !6634, !6635, !6636, !6637, !6638, !6704, !6717, !6721, !6722, !6723, !6724, !6725, !6726, !6727, !6728, !6729, !6730, !6731, !6732, !6733, !6734, !6735, !6736, !6737, !6738, !6739, !6740, !6741, !6742, !6743, !6744, !6745, !6746, !6747, !6748, !6749, !6750, !6751, !6752, !6753, !6754, !6755, !6756, !6757, !6758, !6759, !6760, !6761, !6856, !6857, !6858, !6859, !6860, !6861, !6862, !6863, !6864, !6865, !6866, !6867, !6868, !6869, !6870}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__sk_common", scope: !234, file: !235, line: 327, baseType: !238, size: 1088)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_common", file: !235, line: 162, size: 1088, elements: !239)
!239 = !{!240, !254, !262, !273, !274, !276, !277, !278, !279, !280, !281, !293, !6583, !6584, !6585, !6586, !6587, !6595, !6597, !6602, !6603, !6609, !6610, !6611}
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !235, line: 166, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !235, line: 166, size: 64, elements: !242)
!242 = !{!243, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "skc_addrpair", scope: !241, file: !235, line: 167, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__addrpair", file: !235, line: 131, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !64, line: 30, baseType: !116)
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !235, line: 168, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !241, file: !235, line: 168, size: 64, elements: !248)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "skc_daddr", scope: !247, file: !235, line: 169, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !251, line: 35, baseType: !252)
!251 = !DIFile(filename: "include/uapi/linux/types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "b0970b58e552d262bd5375c7a87fc99e")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !64, line: 26, baseType: !7)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "skc_rcv_saddr", scope: !247, file: !235, line: 170, baseType: !250, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !235, line: 173, baseType: !255, size: 32, offset: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !235, line: 173, size: 32, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "skc_hash", scope: !255, file: !235, line: 174, baseType: !7, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "skc_u16hashes", scope: !255, file: !235, line: 175, baseType: !259, size: 32)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !235, line: 178, baseType: !263, size: 32, offset: 96)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !235, line: 178, size: 32, elements: !264)
!264 = !{!265, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portpair", scope: !263, file: !235, line: 179, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__portpair", file: !235, line: 130, baseType: !252)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !263, file: !235, line: 180, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !235, line: 180, size: 32, elements: !269)
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "skc_dport", scope: !268, file: !235, line: 181, baseType: !271, size: 16)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !251, line: 33, baseType: !63)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "skc_num", scope: !268, file: !235, line: 182, baseType: !63, size: 16, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "skc_family", scope: !238, file: !235, line: 186, baseType: !65, size: 16, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "skc_state", scope: !238, file: !235, line: 187, baseType: !275, size: 8, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuse", scope: !238, file: !235, line: 188, baseType: !59, size: 4, offset: 152, flags: DIFlagBitField, extraData: i64 152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "skc_reuseport", scope: !238, file: !235, line: 189, baseType: !59, size: 1, offset: 156, flags: DIFlagBitField, extraData: i64 152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "skc_ipv6only", scope: !238, file: !235, line: 190, baseType: !59, size: 1, offset: 157, flags: DIFlagBitField, extraData: i64 152)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "skc_net_refcnt", scope: !238, file: !235, line: 191, baseType: !59, size: 1, offset: 158, flags: DIFlagBitField, extraData: i64 152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bound_dev_if", scope: !238, file: !235, line: 192, baseType: !39, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !235, line: 193, baseType: !282, size: 128, offset: 192)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !235, line: 193, size: 128, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "skc_bind_node", scope: !282, file: !235, line: 194, baseType: !76, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "skc_portaddr_node", scope: !282, file: !235, line: 195, baseType: !286, size: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_nulls_node", file: !287, line: 24, size: 128, elements: !288)
!287 = !DIFile(filename: "include/linux/list_nulls.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "3654b2fcb11b629177cf81e99ba18e60")
!288 = !{!289, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !287, line: 25, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !286, file: !287, line: 25, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "skc_prot", scope: !238, file: !235, line: 197, baseType: !294, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proto", file: !235, line: 967, size: 3200, elements: !296)
!296 = !{!297, !301, !317, !321, !326, !330, !334, !338, !342, !346, !350, !351, !352, !356, !6505, !6509, !6513, !6514, !6518, !6519, !6520, !6521, !6522, !6526, !6527, !6528, !6534, !6535, !6536, !6538, !6539, !6541, !6542, !6543, !6544, !6545, !6546, !6547, !6548, !6549, !6552, !6555, !6567, !6568, !6569, !6570, !6574, !6578}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !295, file: !235, line: 968, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !233, !157}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !295, file: !235, line: 970, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!39, !233, !305, !39}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !307, line: 29, size: 128, elements: !308)
!307 = !DIFile(filename: "include/linux/socket.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "1f7e64fb50216e5b86abd533274eb922")
!308 = !{!309, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !306, file: !307, line: 30, baseType: !310, size: 16)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !307, line: 23, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !312, line: 11, baseType: !65)
!312 = !DIFile(filename: "include/uapi/linux/socket.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "e17cc88f6e233fd7a1b6220bed7ed011")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !306, file: !307, line: 31, baseType: !314, size: 112, offset: 16)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 112, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 14)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !295, file: !235, line: 973, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!39, !233, !39}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !295, file: !235, line: 975, baseType: !322, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!233, !233, !39, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !295, file: !235, line: 977, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!39, !233, !39, !85}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !295, file: !235, line: 979, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!39, !233}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !295, file: !235, line: 980, baseType: !335, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !233}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !295, file: !235, line: 981, baseType: !339, size: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !233, !39}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "setsockopt", scope: !295, file: !235, line: 982, baseType: !343, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!39, !233, !39, !39, !83, !7}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "getsockopt", scope: !295, file: !235, line: 985, baseType: !347, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!39, !233, !39, !39, !83, !325}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_setsockopt", scope: !295, file: !235, line: 989, baseType: !343, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_getsockopt", scope: !295, file: !235, line: 993, baseType: !347, size: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_ioctl", scope: !295, file: !235, line: 997, baseType: !353, size: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!39, !233, !7, !85}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !295, file: !235, line: 1000, baseType: !357, size: 64, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!39, !233, !360, !372}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !307, line: 47, size: 704, elements: !362)
!362 = !{!363, !365, !366, !6501, !6502, !6503, !6504}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !361, file: !307, line: 48, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !361, file: !307, line: 49, baseType: !39, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iter", scope: !361, file: !307, line: 50, baseType: !367, size: 320, offset: 128)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !368, line: 28, size: 320, elements: !369)
!368 = !DIFile(filename: "include/linux/uio.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "42974667506b0dbb962fc0ca653fe770")
!369 = !{!370, !371, !376, !377, !6500}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 29, baseType: !39, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "iov_offset", scope: !367, file: !368, line: 30, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 54, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !374, line: 71, baseType: !375)
!374 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "cf72d7aedba88ea4de1d7d40a7595304")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !374, line: 15, baseType: !85)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !367, file: !368, line: 31, baseType: !372, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, scope: !367, file: !368, line: 32, baseType: !378, size: 64, offset: 192)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !367, file: !368, line: 32, size: 64, elements: !379)
!379 = !{!380, !388, !395}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !378, file: !368, line: 33, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !384, line: 16, size: 128, elements: !385)
!384 = !DIFile(filename: "include/uapi/linux/uio.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "5a32c4abb8cbe2fa121f543cea092132")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !383, file: !384, line: 18, baseType: !364, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !383, file: !384, line: 19, baseType: !373, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "kvec", scope: !378, file: !368, line: 34, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !368, line: 17, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !391, file: !368, line: 18, baseType: !364, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !391, file: !368, line: 19, baseType: !372, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bvec", scope: !378, file: !368, line: 35, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_vec", file: !399, line: 23, size: 128, elements: !400)
!399 = !DIFile(filename: "include/linux/blk_types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "bf5a3deceb57f9d177ab2dc045960ef8")
!400 = !{!401, !6498, !6499}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bv_page", scope: !398, file: !399, line: 24, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !404, line: 44, size: 512, align: 128, elements: !405)
!404 = !DIFile(filename: "include/linux/mm_types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "9998c058d072fb08fc0e77fed7f78864")
!405 = !{!406, !407, !6440, !6468, !6491, !6497}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !403, file: !404, line: 46, baseType: !85, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !404, line: 48, baseType: !408, size: 64, offset: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !404, line: 48, size: 64, elements: !409)
!409 = !{!410, !6439}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !408, file: !404, line: 49, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !413, line: 432, size: 1216, align: 64, elements: !414)
!413 = !DIFile(filename: "include/linux/fs.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "79de8629fb1fe92f25d34faee70a6dc0")
!414 = !{!415, !6338, !6339, !6340, !6341, !6342, !6343, !6344, !6345, !6346, !6435, !6436, !6437, !6438}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !412, file: !413, line: 433, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !413, line: 590, size: 4480, elements: !418)
!418 = !{!419, !421, !422, !430, !437, !438, !441, !442, !6275, !6276, !6277, !6278, !6279, !6285, !6286, !6287, !6288, !6289, !6290, !6291, !6292, !6293, !6294, !6295, !6296, !6297, !6298, !6299, !6300, !6301, !6302, !6303, !6304, !6305, !6306, !6311, !6312, !6313, !6314, !6315, !6316, !6317, !6325, !6326, !6327, !6334, !6335, !6336, !6337}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !417, file: !413, line: 591, baseType: !420, size: 16)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !51, line: 18, baseType: !65)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !417, file: !413, line: 592, baseType: !65, size: 16, offset: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !417, file: !413, line: 593, baseType: !423, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !424, line: 22, baseType: !425)
!424 = !DIFile(filename: "include/linux/uidgid.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "dff0158c41b84ce992b93151e1df5809")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 20, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !425, file: !424, line: 21, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !51, line: 31, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !374, line: 48, baseType: !7)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !417, file: !413, line: 594, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !424, line: 27, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 25, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !432, file: !424, line: 26, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !51, line: 32, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !374, line: 49, baseType: !7)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !417, file: !413, line: 595, baseType: !7, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !417, file: !413, line: 598, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !413, line: 578, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !417, file: !413, line: 599, baseType: !439, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !417, file: !413, line: 602, baseType: !443, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !413, line: 1681, size: 2048, align: 512, elements: !446)
!446 = !{!447, !6133, !6137, !6141, !6145, !6149, !6153, !6157, !6161, !6165, !6169, !6173, !6174, !6178, !6182, !6186, !6202, !6223, !6227, !6231, !6235, !6239, !6262, !6266, !6270, !6271}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !445, file: !413, line: 1682, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !416, !451, !7}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !453, line: 108, size: 1536, elements: !454)
!453 = !DIFile(filename: "include/linux/dcache.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "2c3713b55045a5ce71922135baab7d16")
!454 = !{!455, !456, !462, !470, !471, !486, !487, !491, !531, !599, !6123, !6124, !6125, !6126, !6127, !6128}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !452, file: !453, line: 110, baseType: !7, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !452, file: !453, line: 111, baseType: !457, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !458, line: 52, baseType: !459)
!458 = !DIFile(filename: "include/linux/seqlock.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "e6b2f7a0f85d23f0291d0e2a1dcedd7d")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !458, line: 47, size: 32, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !459, file: !458, line: 48, baseType: !7, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !452, file: !453, line: 112, baseType: !463, size: 128, offset: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !464, line: 37, size: 128, elements: !465)
!464 = !DIFile(filename: "include/linux/list_bl.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "19d5dcdc1bb4cc3a380cc71ea2e66b85")
!465 = !{!466, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !464, line: 38, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !463, file: !464, line: 38, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !452, file: !453, line: 113, baseType: !451, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !452, file: !453, line: 114, baseType: !472, size: 128, offset: 256)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !453, line: 44, size: 128, elements: !473)
!473 = !{!474, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !453, line: 45, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !472, file: !453, line: 45, size: 64, elements: !476)
!476 = !{!477, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !453, line: 46, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !453, line: 46, size: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !478, file: !453, line: 47, baseType: !219, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !478, file: !453, line: 47, baseType: !219, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !475, file: !453, line: 49, baseType: !115, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !453, line: 51, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !452, file: !453, line: 115, baseType: !416, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !452, file: !453, line: 117, baseType: !488, size: 256, offset: 448)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "d_lockref", scope: !452, file: !453, line: 120, baseType: !492, size: 64, offset: 704)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockref", file: !493, line: 24, size: 64, elements: !494)
!493 = !DIFile(filename: "include/linux/lockref.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "e90a9b0fc859d76b12213b93903d187a")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, scope: !492, file: !493, line: 25, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !492, file: !493, line: 25, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !496, file: !493, line: 27, baseType: !245, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, scope: !496, file: !493, line: 29, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !496, file: !493, line: 29, size: 64, elements: !501)
!501 = !{!502, !530}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !500, file: !493, line: 30, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !504, line: 76, baseType: !505)
!504 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "ce65244ca205518a4354b92141eb6381")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !504, line: 64, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, scope: !505, file: !504, line: 65, baseType: !508, size: 32)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !504, line: 65, size: 32, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !508, file: !504, line: 66, baseType: !511, size: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !504, line: 20, size: 32, elements: !512)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !511, file: !504, line: 21, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !515, line: 36, baseType: !516)
!515 = !DIFile(filename: "./arch/x86/include/asm/spinlock_types.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "4b4835630a7b6187d9676eb75f2ebeef")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_spinlock", file: !515, line: 29, size: 32, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !516, file: !515, line: 30, baseType: !519, size: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !516, file: !515, line: 30, size: 32, elements: !520)
!520 = !{!521, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "head_tail", scope: !519, file: !515, line: 31, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticketpair_t", file: !515, line: 19, baseType: !219)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tickets", scope: !519, file: !515, line: 34, baseType: !524, size: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__raw_tickets", file: !515, line: 32, size: 32, elements: !525)
!525 = !{!526, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !524, file: !515, line: 33, baseType: !527, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ticket_t", file: !515, line: 18, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !58, line: 19, baseType: !65)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !524, file: !515, line: 33, baseType: !527, size: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !500, file: !493, line: 31, baseType: !39, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !452, file: !453, line: 121, baseType: !532, size: 64, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !453, line: 150, size: 1024, align: 512, elements: !535)
!535 = !{!536, !540, !541, !548, !556, !560, !564, !565, !569, !573, !585, !591, !595}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !534, file: !453, line: 151, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!39, !451, !7}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !534, file: !453, line: 152, baseType: !537, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !534, file: !453, line: 153, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!39, !545, !547}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !534, file: !453, line: 154, baseType: !549, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!39, !545, !545, !7, !552, !554}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !534, file: !453, line: 156, baseType: !557, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!39, !545}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !534, file: !453, line: 157, baseType: !561, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !451}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !534, file: !453, line: 158, baseType: !561, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !534, file: !453, line: 159, baseType: !566, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !451, !416}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !534, file: !453, line: 160, baseType: !570, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!83, !451, !83, !39}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !534, file: !453, line: 161, baseType: !574, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !579}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !453, line: 15, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !581, line: 7, size: 128, elements: !582)
!581 = !DIFile(filename: "include/linux/path.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "ebff22ee31567c1072ceb03ce76b427e")
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !580, file: !581, line: 8, baseType: !577, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !580, file: !581, line: 9, baseType: !451, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "d_manage", scope: !534, file: !453, line: 162, baseType: !586, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!39, !451, !589}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !51, line: 29, baseType: !590)
!590 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "d_select_inode", scope: !534, file: !453, line: 163, baseType: !592, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!416, !451, !7}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "d_real", scope: !534, file: !453, line: 164, baseType: !596, size: 64, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!451, !451, !416}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "d_sb", scope: !452, file: !453, line: 122, baseType: !600, size: 64, offset: 832)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !413, line: 1323, size: 12800, elements: !602)
!602 = !{!603, !604, !607, !608, !609, !612, !5695, !5852, !5883, !5962, !5966, !5967, !5968, !5969, !5970, !5971, !5972, !5973, !5974, !5979, !5983, !5984, !5985, !5986, !5989, !5990, !5991, !6032, !6061, !6062, !6064, !6065, !6066, !6067, !6068, !6069, !6070, !6071, !6072, !6073, !6088, !6089, !6090, !6091, !6092, !6116, !6117, !6118, !6119, !6120, !6121, !6122}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !601, file: !413, line: 1324, baseType: !92, size: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !601, file: !413, line: 1325, baseType: !605, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 15, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !51, line: 12, baseType: !252)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !601, file: !413, line: 1326, baseType: !59, size: 8, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !601, file: !413, line: 1327, baseType: !85, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !601, file: !413, line: 1328, baseType: !610, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !51, line: 45, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !374, line: 87, baseType: !207)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !601, file: !413, line: 1329, baseType: !613, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !413, line: 1969, size: 448, elements: !615)
!615 = !{!616, !617, !618, !622, !626, !5685, !5686, !5687, !5688, !5689, !5690, !5692, !5693, !5694}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !413, line: 1970, baseType: !552, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !614, file: !413, line: 1971, baseType: !39, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !614, file: !413, line: 1979, baseType: !619, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!451, !613, !39, !552, !364}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !614, file: !413, line: 1981, baseType: !623, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !600}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !614, file: !413, line: 1982, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 311, size: 6656, align: 512, elements: !629)
!629 = !{!630, !631, !632, !636, !5464, !5490, !5491, !5492, !5493, !5501, !5504, !5505, !5506, !5556, !5557, !5558, !5559, !5560, !5561, !5562, !5563, !5564, !5565, !5566, !5567, !5568, !5569, !5570, !5571, !5572, !5579, !5583, !5584, !5585, !5586, !5587, !5588, !5589, !5599, !5600, !5601, !5602, !5605, !5606, !5607, !5608, !5617, !5639, !5640, !5643, !5646, !5647, !5648, !5649, !5650, !5655, !5664, !5665, !5666, !5668, !5672, !5673, !5677, !5678, !5679, !5680, !5681, !5682, !5683, !5684}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !628, file: !6, line: 312, baseType: !5, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !628, file: !6, line: 315, baseType: !92, size: 128, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !6, line: 318, baseType: !633, size: 448, offset: 192)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 448, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 56)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !628, file: !6, line: 321, baseType: !637, size: 768, offset: 640)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 41, size: 768, elements: !638)
!638 = !{!639, !5458, !5459, !5460, !5463}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !637, file: !6, line: 42, baseType: !640, size: 512)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !641, line: 63, size: 512, elements: !642)
!641 = !DIFile(filename: "include/linux/kobject.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "e26cbe402580fda1579b22adbb36b2fe")
!642 = !{!643, !644, !645, !647, !689, !756, !5452, !5453, !5454, !5455, !5456, !5457}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !641, line: 64, baseType: !552, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !640, file: !641, line: 65, baseType: !92, size: 128, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !640, file: !641, line: 66, baseType: !646, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !640, file: !641, line: 67, baseType: !648, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !641, line: 185, size: 768, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !649, file: !641, line: 186, baseType: !92, size: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !649, file: !641, line: 187, baseType: !503, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !649, file: !641, line: 188, baseType: !640, size: 512, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !649, file: !641, line: 189, baseType: !655, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !641, line: 149, size: 192, elements: !658)
!658 = !{!659, !664, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !657, file: !641, line: 150, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!39, !648, !646}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !641, line: 151, baseType: !665, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!552, !648, !646}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !657, file: !641, line: 152, baseType: !670, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!39, !648, !646, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !641, line: 141, size: 18688, elements: !676)
!676 = !{!677, !681, !683, !684, !688}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !675, file: !641, line: 142, baseType: !678, size: 192)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 192, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 3)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !675, file: !641, line: 143, baseType: !682, size: 2048, offset: 192)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, elements: !489)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !675, file: !641, line: 144, baseType: !39, size: 32, offset: 2240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !675, file: !641, line: 145, baseType: !685, size: 16384, offset: 2272)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 16384, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 2048)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !675, file: !641, line: 146, baseType: !39, size: 32, offset: 18656)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !640, file: !641, line: 68, baseType: !690, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !641, line: 133, size: 320, elements: !692)
!692 = !{!693, !697, !719, !721, !752}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !691, file: !641, line: 134, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !646}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !691, file: !641, line: 135, baseType: !698, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !701, line: 215, size: 128, elements: !702)
!701 = !DIFile(filename: "include/linux/sysfs.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "17d7b5fa14ab2080d083d49a46c4ae46")
!702 = !{!703, !715}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !700, file: !701, line: 216, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !646, !710, !83}
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !51, line: 59, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !374, line: 72, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !374, line: 14, baseType: !157)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !701, line: 29, size: 128, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !701, line: 30, baseType: !552, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !711, file: !701, line: 31, baseType: !420, size: 16, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !700, file: !701, line: 217, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!707, !646, !710, !552, !372}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !691, file: !641, line: 136, baseType: !720, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !691, file: !641, line: 137, baseType: !722, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !646}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !14, line: 40, size: 384, elements: !728)
!728 = !{!729, !730, !734, !738, !744, !748}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !14, line: 41, baseType: !13, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !727, file: !14, line: 42, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!589}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !727, file: !14, line: 43, baseType: !735, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!364}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !727, file: !14, line: 44, baseType: !739, size: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !233}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !727, file: !14, line: 45, baseType: !745, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!742}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !727, file: !14, line: 46, baseType: !749, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !364}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !691, file: !641, line: 138, baseType: !753, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!742, !646}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !640, file: !641, line: 69, baseType: !757, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !759, line: 106, size: 960, elements: !760)
!759 = !DIFile(filename: "include/linux/kernfs.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "1439d3b88588930fd4568d0e35cf12f4")
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !5445, !5446, !5447, !5448, !5449}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !758, file: !759, line: 107, baseType: !50, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !758, file: !759, line: 108, baseType: !50, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !758, file: !759, line: 118, baseType: !757, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !759, line: 119, baseType: !552, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !758, file: !759, line: 121, baseType: !222, size: 192, align: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !758, file: !759, line: 123, baseType: !742, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !758, file: !759, line: 124, baseType: !7, size: 32, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, scope: !758, file: !759, line: 125, baseType: !769, size: 256, offset: 512)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !758, file: !759, line: 125, size: 256, elements: !770)
!770 = !{!771, !5430, !5434}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !769, file: !759, line: 126, baseType: !772, size: 192)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !759, line: 74, size: 192, elements: !773)
!773 = !{!774, !775, !779}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !772, file: !759, line: 75, baseType: !85, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !772, file: !759, line: 77, baseType: !776, size: 64, offset: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !223, line: 43, size: 64, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !776, file: !223, line: 44, baseType: !227, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !772, file: !759, line: 83, baseType: !780, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !759, line: 157, size: 896, elements: !782)
!782 = !{!783, !784, !785, !834, !5428, !5429}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !781, file: !759, line: 159, baseType: !757, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !759, line: 160, baseType: !7, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ino_ida", scope: !781, file: !759, line: 163, baseType: !786, size: 384, offset: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !787, line: 154, size: 384, elements: !788)
!787 = !DIFile(filename: "include/linux/idr.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "7b268d876df947f6733b73660832e79c")
!788 = !{!789, !825}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "idr", scope: !786, file: !787, line: 155, baseType: !790, size: 320)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !787, line: 42, size: 320, elements: !791)
!791 = !{!792, !819, !820, !821, !822, !823, !824}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !790, file: !787, line: 43, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr_layer", file: !787, line: 30, size: 16768, elements: !795)
!795 = !{!796, !797, !798, !802, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !794, file: !787, line: 31, baseType: !39, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !794, file: !787, line: 32, baseType: !39, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ary", scope: !794, file: !787, line: 33, baseType: !799, size: 16384, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 16384, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !787, line: 34, baseType: !39, size: 32, offset: 16448)
!803 = !DIDerivedType(tag: DW_TAG_member, scope: !794, file: !787, line: 35, baseType: !804, size: 256, offset: 16512)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !787, line: 35, size: 256, elements: !805)
!805 = !{!806, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !804, file: !787, line: 37, baseType: !807, size: 256)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 256, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 4)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "callback_head", scope: !804, file: !787, line: 38, baseType: !811, size: 128, align: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !51, line: 223, size: 128, align: 64, elements: !812)
!812 = !{!813, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !811, file: !51, line: 224, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !811, file: !51, line: 225, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !814}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !790, file: !787, line: 44, baseType: !793, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !790, file: !787, line: 45, baseType: !39, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !790, file: !787, line: 46, baseType: !39, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !790, file: !787, line: 47, baseType: !503, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "id_free_cnt", scope: !790, file: !787, line: 48, baseType: !39, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "id_free", scope: !790, file: !787, line: 49, baseType: !793, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "free_bitmap", scope: !786, file: !787, line: 156, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida_bitmap", file: !787, line: 149, size: 1024, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nr_busy", scope: !827, file: !787, line: 150, baseType: !157, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !827, file: !787, line: 151, baseType: !831, size: 960, offset: 64)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 960, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 15)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !781, file: !759, line: 164, baseType: !835, size: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !759, line: 146, size: 320, elements: !837)
!837 = !{!838, !842, !5416, !5420, !5424}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !836, file: !759, line: 147, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!39, !780, !325, !83}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !836, file: !759, line: 148, baseType: !843, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!39, !846, !780}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !848, line: 15, size: 1088, elements: !849)
!848 = !DIFile(filename: "include/linux/seq_file.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "6c54d59131b22e21a2be9b263eaa4095")
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !5402, !5411, !5412, !5415}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !847, file: !848, line: 16, baseType: !83, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !848, line: 17, baseType: !372, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !847, file: !848, line: 18, baseType: !372, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !847, file: !848, line: 19, baseType: !372, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !847, file: !848, line: 20, baseType: !372, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !847, file: !848, line: 21, baseType: !610, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !847, file: !848, line: 22, baseType: !610, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !847, file: !848, line: 23, baseType: !115, size: 64, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !847, file: !848, line: 24, baseType: !859, size: 320, offset: 512)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !860, line: 50, size: 320, elements: !861)
!860 = !DIFile(filename: "include/linux/mutex.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "6886f6396e165026f04f1dfd793c6cc6")
!861 = !{!862, !863, !864, !865, !5401}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !859, file: !860, line: 52, baseType: !50, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !859, file: !860, line: 53, baseType: !503, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !859, file: !860, line: 54, baseType: !92, size: 128, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !859, file: !860, line: 56, baseType: !866, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !868, line: 1391, size: 71168, elements: !869)
!868 = !DIFile(filename: "include/linux/sched.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "39faab38be613da60551ff363d7ccfd7")
!869 = !{!870, !872, !873, !874, !875, !876, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !896, !958, !967, !970, !1046, !1050, !1051, !1052, !1053, !1062, !1069, !1070, !1077, !1078, !1825, !1826, !1827, !1829, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1908, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1925, !1926, !1927, !1929, !1930, !1931, !1934, !1935, !1936, !1937, !1938, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1956, !1958, !1959, !1960, !1961, !1962, !1965, !1972, !1977, !1978, !1981, !1984, !3140, !4223, !4252, !4253, !4254, !4255, !4256, !4257, !4258, !4259, !4263, !4264, !4265, !4273, !4274, !4275, !4276, !4277, !4282, !4283, !4284, !4288, !4289, !4678, !4681, !4684, !4766, !4767, !4768, !4838, !4839, !4840, !4841, !4842, !4848, !4849, !4850, !4851, !4870, !4871, !4874, !4887, !4888, !4891, !4895, !4896, !4897, !4898, !4899, !4900, !4901, !4902, !4903, !4904, !4905, !4906, !4907, !4908, !4909, !4910, !4913, !4914, !4915, !4917, !4918, !4924, !4925, !4926, !4932, !4946, !4947, !4948, !4949, !4950, !4951, !4952, !4955, !4956, !4957, !4958, !4959, !4960, !5218, !5219, !5220, !5221, !5222, !5223, !5224}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !867, file: !868, line: 1392, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !157)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !867, file: !868, line: 1393, baseType: !364, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !867, file: !868, line: 1394, baseType: !50, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !867, file: !868, line: 1395, baseType: !7, size: 32, offset: 160)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !867, file: !868, line: 1396, baseType: !7, size: 32, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !867, file: !868, line: 1399, baseType: !877, size: 64, offset: 256)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !878, line: 65, size: 64, elements: !879)
!878 = !DIFile(filename: "include/linux/llist.h", directory: "/home/secondst/linux/linux-ce624b2089ea", checksumkind: CSK_MD5, checksum: "7ab30ff6b730483cbf30f1df258daa4b")
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !877, file: !878, line: 66, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !867, file: !868, line: 1400, baseType: !39, size: 32, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flips", scope: !867, file: !868, line: 1401, baseType: !7, size: 32, offset: 352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flip_decay_ts", scope: !867, file: !868, line: 1402, baseType: !85, size: 64, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "last_wakee", scope: !867, file: !868, line: 1403, baseType: !866, size: 64, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "wake_cpu", scope: !867, file: !868, line: 1405, baseType: !39, size: 32, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !867, file: !868, line: 1407, baseType: !39, size: 32, offset: 544)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !867, file: !868, line: 1409, baseType: !39, size: 32, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !867, file: !868, line: 1409, baseType: !39, size: 32, offset: 608)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !867, file: !868, line: 1409, baseType: !39, size: 32, offset: 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !867, file: !868, line: 1410, baseType: !7, size: 32, offset: 672)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !867, file: !868, line: 1411, baseType: !893, size: 64, offset: 704)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !868, line: 1411, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !867, file: !868, line: 1412, baseType: !897, size: 3136, offset: 768)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !868, line: 1256, size: 3136, elements: !898)
!898 = !{!899, !904, !905, !906, !907, !908, !909, !910, !911, !912, !942, !943, !945, !948, !949}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !897, file: !868, line: 1257, baseType: !900, size: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !868, line: 1195, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !900, file: !868, line: 1196, baseType: !85, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !900, file: !868, line: 1197, baseType: !219, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !897, file: !868, line: 1258, baseType: !222, size: 192, align: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !897, file: !868, line: 1259, baseType: !92, size: 128, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !897, file: !868, line: 1260, baseType: !7, size: 32, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !897, file: !868, line: 1262, baseType: !115, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !897, file: !868, line: 1263, baseType: !115, size: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !897, file: !868, line: 1264, baseType: !115, size: 64, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !897, file: !868, line: 1265, baseType: !115, size: 64, offset: 704)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !897, file: !868, line: 1267, baseType: !115, size: 64, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !897, file: !868, line: 1270, baseType: !913, size: 1728, offset: 832)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !868, line: 1221, size: 1728, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !913, file: !868, line: 1222, baseType: !115, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !913, file: !868, line: 1223, baseType: !115, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !913, file: !868, line: 1224, baseType: !115, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !913, file: !868, line: 1225, baseType: !115, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !913, file: !868, line: 1226, baseType: !115, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !913, file: !868, line: 1227, baseType: !115, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !913, file: !868, line: 1229, baseType: !115, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !913, file: !868, line: 1230, baseType: !115, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !913, file: !868, line: 1231, baseType: !206, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !913, file: !868, line: 1233, baseType: !115, size: 64, offset: 576)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !913, file: !868, line: 1234, baseType: !115, size: 64, offset: 640)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !913, file: !868, line: 1235, baseType: !115, size: 64, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !913, file: !868, line: 1236, baseType: !115, size: 64, offset: 768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !913, file: !868, line: 1238, baseType: !115, size: 64, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !913, file: !868, line: 1239, baseType: !115, size: 64, offset: 896)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !913, file: !868, line: 1240, baseType: !115, size: 64, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !913, file: !868, line: 1241, baseType: !115, size: 64, offset: 1024)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !913, file: !868, line: 1242, baseType: !115, size: 64, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !913, file: !868, line: 1244, baseType: !115, size: 64, offset: 1152)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !913, file: !868, line: 1245, baseType: !115, size: 64, offset: 1216)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !913, file: !868, line: 1246, baseType: !115, size: 64, offset: 1280)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !913, file: !868, line: 1247, baseType: !115, size: 64, offset: 1344)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !913, file: !868, line: 1248, baseType: !115, size: 64, offset: 1408)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !913, file: !868, line: 1249, baseType: !115, size: 64, offset: 1472)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !913, file: !868, line: 1250, baseType: !115, size: 64, offset: 1536)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !913, file: !868, line: 1251, baseType: !115, size: 64, offset: 1600)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !913, file: !868, line: 1252, baseType: !115, size: 64, offset: 1664)
